# Створити програму на Python, яка запитує у користувача особисті дані та зберігає їх у відповідні змінні.
#
# Задачі:
#
# Використовуйте функцію input для отримання від користувача наступних даних:
# Ім'я name, як рядок.
# Електронну пошту email, як рядок.
# Вік age, як ціле число, тип int.
# Зріст height, як дійсне число, тип float.
# Бажання отримувати повідомлення від сайту is_active, як булеве значення.
# Для кожної змінної створіть окреме запитання відповідно до її типу даних.
# Переконайтеся, що введені дані перетворюються в правильний тип даних перед збереженням у змінних.
# Очікуваний результат:
#
# Програма повинна запитувати у користувача ім'я, електронну пошту, вік, зріст та бажання отримувати повідомлення, і
# зберігати ці дані у відповідних змінних.
#
# Підказки:
#
# Використовуйте int() та float() для перетворення рядкових значень у відповідні числові типи.
# Для перетворення рядкового введення в булеве значення, ми вважаємо, що якщо користувач не згоден, то він нічого не
# вів у функцію input.
name = str(input("Your name? "))
email = str(input("Your email? "))
age = int(input("Your age? "))
height = float(input("Your height? "))
is_active = bool(input("Is active? "))