# Створіть програму на Python, яка модифікує порожній словник cat, додаючи до нього різні ключі та значення, а також
# використовує значення з іншого словника info.
#
# Задачі:
#
# Використовуйте словник cat для зберігання інформації про кота. Додайте до нього наступні ключі та відповідні значення:
# Ключ "nick" з рядковим значенням імені кота (наприклад, "Simon").
# Ключ "age" з цілим числовим значенням віку кота (наприклад, 7).
# Ключ "characteristics" зі списком характеристик кота (наприклад, ["лагідний", "кусається"]).
# Оголосіть змінну age та використовуйте метод get для отримання віку кота зі словника cat.
# Використайте метод update, щоб додати до словника cat всі пари ключ-значення зі словника info.
# Очікуваний результат:
#
# Після виконання програми, словник cat повинен містити всю вказану інформацію про кота, включаючи ім'я, вік,
# характеристики та додаткові дані зі словника info.

cat = {}
info = {"status": "vaccinated", "breed": True}
cat["nick"] = "Simon"
cat["age"] = 7
cat["characteristics"] = ["bite", "calm"]
age = cat.get("age")
cat.update(info)
print(cat)