# Необхідно створити програму на Python, яка розраховує площу кімнати, отримуючи значення довжини та ширини від
# користувача через функцію input та перетворюючи їх з рядкового типу у числовий (float).
#
# Задачі:
#
# Використовуйте функцію input для отримання значень довжини length та ширини width кімнати від користувача.
# Переконайтеся, що введені дані перетворюються з рядкового типу в числовий тип float негайно після отримання їх через
# input.
# Розрахуйте площу кімнати area, перемноживши перетворені значення length та width.
# Очікуваний результат:
#
# Програма повинна запитати у користувача довжину та ширину кімнати, перетворити ці значення з рядкових у дійсні числа,
# а потім розрахувати площу кімнати.
#
# Підказки:
#
# Пам'ятайте, що input завжди повертає рядкове значення, тому його потрібно перетворити у числовий тип, якщо ви плануєте
# використовувати ці дані для математичних обчислень.
# Використовуйте float() для перетворення рядкового введення в дійсне число.
length = float(input("Enter length"))
width = float(input("Enter width"))
area = length * width