# Створить програму на Python, яка розраховує вартість споживання електроенергії на основі заданого тарифу та показників лічильника.
#
# Задачі:
# У змінній rate зберігається вартість одного кіловата електроенергії. Встановіть для цієї змінної значення 1.68.
# У змінній value повинно бути значення показання лічильника електроенергії в кіловатах. Задайте для value розумне ціле число.
# Розрахуйте вартість споживання електроенергії, помноживши rate на value, та збережіть результат у змінній payment.
rate = 1.68
value = 200
payment = rate * value