# При покупці квитків нам завжди необхідно знати ім'я та прізвище покупця. Створіть дві рядкові змінні для зберігання
# імені та прізвища покупця квитків.
#
# Задачі:
# Оголосіть змінну first_name та привласніть їй ім'я.
# Оголосіть змінну last_name та привласніть їй прізвище.
# Очікуваний результат:
# Після виконання програми, ви повинні мати дві змінні: first_name та last_name, кожна з яких містить відповідну частину
# вашого імені.
#
# Підказки:
# Пам'ятайте, що рядкові значення в Python повинні бути вказані у лапках.
# Виберіть ім'я та прізвище, які ви б хотіли використовувати для цього завдання.
first_name = "Joe"
last_name = "Doe"
