# Створіть програму на Python, яка розраховує площу кімнати за допомогою заданих довжини та ширини, та генерує
# інформативне повідомлення про результати розрахунку.
#
# Задачі:
#
# Використовуйте змінні length та width для зберігання довжини та ширини кімнати відповідно. Задайте їм значення 2.75
# та 1.75.
# Розрахуйте площу кімнати area, перемноживши length та width.
# Створіть змінну show, яка міститиме рядок з інформацією про довжину, ширину та площу кімнати. Використовуйте функцію
# форматування рядків для вставки значень змінних length, width та area у вказаний шаблон.
# Шаблон: 'With width <значення ширини> and length <значення довжини> of the room, its area is equal to <значення площі>'
# Очікуваний результат:
#
# Програма повинна в змінній show зберігати рядок, що інформує про довжину та ширину кімнати та її загальну площу.
# Підказки:
#
# Використовуйте f-рядок для формування рядка змінної show, що дозволить вставляти значення змінних безпосередньо в текст.
# Переконайтеся, що у виведеному рядку коректно вказано довжину, ширину та площу кімнати.
length = 2.75
width = 1.75
area = length * width
show = f"With width {width} and length {length} of the room, its area is equal to {area}"