# Структурні патерни
#
# Фасад (Facade)
# Паттерн проектування, який надає простий інтерфейс до складної системі класів, бібліотеки або фреймворку.

# Паттерн вирішує проблему, коли бізнес-логіка ваших класів тісно починає переплітатися з деталями реалізації сторонніх
# бібліотек. Код стає заплутаним, а заплутаний код стає важче підтримувати. Для таких цілей і використовують патерн Фасад.
# Простими словами, всю складну логіку ми ховаємо за простим інтерфейсом.

# Прикладом може бути замовлення в інтернет-магазині. У вас є фасад – це сайт, на якому ви робите замовлення. Від вас
# захована вся функціональність, ви не телефонуєте на склад, не виписуєте накладну тощо. Все просто – є фасад сайту,
# де мінімум необхідного функціоналу для роботи.

# Якщо коротко підбити підсумок – ми використовуємо патерн Фасад, замість прямої роботи з об'єктами складної форми.
