#
# π  - одне з найважливіших та найбільш інтригуючих чисел у математиці. Ця константа, що приблизно дорівнює 3,14,
# використовується для обчислення довжини кола з урахуванням його радіуса
#
# Обчислення Пі за допомогою нескінченного числового ряду
#
# Використання ряду Нілаканта. Це нескінченний ряд для обчислення  π , який досить легко зрозуміти. Він дає точне
# значення Пі досить швидко.
#
# π=3+4(2⋅3⋅4)−4(4⋅5⋅6)+4(6⋅7⋅8)−4(4⋅5⋅6)+4(6⋅7⋅8)−4(8⋅9⋅10)+4(10⋅11⋅12)−4(12⋅13⋅14)…
#
# Для цього ряду запишіть число 3 і чергуйте додавання і віднімання дробів із числом 4 у чисельнику і добутком трьох
# послідовних цілих чисел, які збільшуються з кожною новою ітерацією, у знаменнику. Кожен наступний добуток починається
# з найбільшого числа, використовуваного в попередньому добутку. Проробіть це всього кілька разів і ви отримаєте досить
# точне значення Пі.

from decimal import Decimal, getcontext

test = Decimal('3.14159')

precision = Decimal(0.000001)
getcontext().prec = 7
is_operation = True

pi = Decimal('3')
first = 2
second = 3
third = 4

while abs(pi - test) > precision:
    if is_operation:
        pi = pi + Decimal('4') / Decimal(first * second * third)
    else:
        pi = pi - Decimal('4') / Decimal(first * second * third)

    first += 2
    second += 2
    third += 2
    is_operation = not is_operation

print(pi.quantize(Decimal('1.0000000')))
print(pi)
