# FIFO (англ. first in, first out - "першим прийшов - першим пішов") - спосіб організації даних або іншими словами черга.
# Цей вираз описує принцип технічної обробки черги або обслуговування конфліктних вимог шляхом упорядкування процесу за
# принципом: "першим прийшов - першим обслужений" (ПППО). Той, хто приходить першим, той і обслуговується першим, той,
# хто прийшов наступним, чекає, поки обслуговування першого не буде закінчено, і так далі.
from collections import deque

MAX_LEN = 10

fifo = deque(maxlen=MAX_LEN)

def push(element):
    fifo.append(element)

def pop():
    fifo.popleft()

push('Biba')
push('Boba')
print(fifo)
pop()
push('Carl')
print(fifo)