# Generics
#
# Дженерики або універсальні типи. Уявімо ситуацію, що у нас є функція, яка додає два параметри і повертає результат – суму
# цих параметрів. Ці параметри можуть бути рядками, цілими або дійсними числами. Щоб уникнути повторення коду і не писати
# для кожного випадку свою функцію зі своїми типами, ми використовуємо дженерики.

from typing import TypeVar

T = TypeVar("T", int, str, float)

def calculator( x: T, y: T) -> T:
    return x + y

print(calculator(3, 5))
print(calculator("Hello", " World"))
print(calculator(3.5, 1.4))

# Виведення:
# 8
# Hello World
# 4.9