# Напишіть програму на Python, яка включає функцію greeting, що виводить вітальне повідомлення, та викличте цю функцію.
#
# Задачі:
# 1) Створіть функцію з назвою greeting.
# 2) Усередині функції використовуйте команду print для виведення повідомлення "Hello world!".
# 3) Після оголошення функції, викличте її, щоб побачити повідомлення на екрані.
#
# Очікуваний результат:
# Коли програма виконується, вона має вивести "Hello world!" на екран.
#
# Підказки:
# Виклик функції виконується за допомогою її імені та пари круглих дужок.
def greeting():
    return print("Hello world!")

greeting()