# Файлові дескриптори
# Коли застосунок завершує свою роботу, результат його роботи, який зберігався у змінних в застосунку, буде втрачений.
# Оперативна пам'ять, яка належала застосунку, буде очищена і результат роботи втрачений. Часто нам необхідно зберігати
# результат роботи, щоб пізніше можна було до нього повернутися. Найпростіший спосіб зберегти корисну інформацію —
# це записати її у файл на диск.
#
#
#
# Python надає функціонал роботи з будь-якими файлами.
#
#
#
# Файлові дескриптори
#
# ​
#
# У Python є абстракція над файлами — це вказівник на файл або файловий дескриптор. Нічого складного в цьому немає,
# це навпаки спрощує роботу з багатьма системними ресурсами.
#
#
#
# Файловий дескриптор — це системний ресурс, доступ до якого надає операційна система. Зазвичай файловий дескриптор
# можна відкрити (отримати/створити), закрити (повідомити системі, що робота з ним завершена), можна записати у нього
# щось і прочитати щось.