# Відкриття та закриття файлів
# Таким чином, робота з файлами у Python починається з відкриття файлу або отримання від системи доступу до файлу,
# отримання того самого файлового дескриптора. Для цього є вбудована функція open, в яку потрібно обов'язково передати
# ім'я файлу, який ми хочемо відкрити, і можна вказати, як саме ми хочемо відкрити файл:

fh = open('test_file.txt')

# В цьому прикладі fh — це файловий дескриптор, спеціальний об'єкт, через який ми можемо працювати з файлом.
# Після того, як робота з файлом завершена, потрібно повернути ресурс (файл) системі. Для цього у файлового дескриптора
# потрібно викликати метод close:

fh = open('test.txt')
fh.close()

# Закривати файл обов'язково. Незакриті дескриптори можуть стати причиною безлічі неочевидних проблем і складнощів.'
# 'Найпростіший випадок — це зіпсований файл і повністю втрачена інформація, яка в ньому могла міститися.
# Крім того, варто пам'ятати, що оскільки файловий дескриптор — це ресурс, який надається операційною системою,
# то будь-яке завершення роботи застосунку (аварійне або штатне) не означає закриття усіх відкритих фалів і,
# знову ж таки, може призвести до помилок.
# Якщо не вказати, як ми хочемо відкрити файл, то він відкривається тільки для читання і за допомогою fh можна буде
# тільки читати з файлу. Якщо файлу з ім'ям test_file.txt в системі немає, то ви отримаєте виняток.
# Режими відкриття файлів в Python вибираються за допомогою другого аргументу функції open.
# Можливі режими відкриття файлів:

# 'r' -  відкриття на читання(я значення за замовчуванням)
# 'w' - відкриття на запис, вміст файлу видаляється, якщо файл не існує, створюється новий
# 'x' - відкриття на запис, якщо файл не існує, інакше виняток
# 'a' - відкриття на дозапис, інформація додається в кінець файлу
# 'b' - відкриття у двійковому режимі
# 't' - відкриття в текстовому режимі(є значенням за замовчуванням)
# '+' - відкриття на читання і запис

# Наприклад, щоб відкрити файл для запису або створити новий, якщо його немає, або перезаписати файл, можна вказати
# значення w:

fh = open('test.txt', 'w')
symbols_written = fh.write('hello!')
print(symbols_written)  # 6
fh.close()

# В цьому прикладі ми відкрили файл test.txt для запису та записали туди рядок 'hello!' завдовжки 6 символів.