# Навігація по файлу
# Python дає можливість управляти положенням курсора у файлі, можна довільно переміщатися файлом за допомогою методу
# seek. Цей метод приймає один аргумент — це кількість символів, на які потрібно змістити курсор у файлі:

fh = open('test.txt', 'w+')
fh.write('hello!')

fh.seek(1)
second = fh.read(1)
print(second)  # 'e'

fh.close()
#
# В цьому прикладі після запису у файл курсор зупинений на останньому символі. У виразі fh.seek(1) ми перемістили
# курсор на другий символ у файлі.

# Переміщаючи курсор, можна перезаписувати символи файлу або читати записане.
#
# Метод seek може приймати опціонально другий аргумент, який буде вказувати, звідки потрібно зчитати зміщення.
# За замовчуванням зміщення задається від початку файлу, але можна задати з кінця або з поточного положення. На жаль,
# зазначення зміщення з кінця файлу не на всіх платформах підтримується і краще використовувати варіант за замовчуванням.
# Щоб дізнатися положення курсора в цей момент, можна скористатися методом tell, він повертає позицію (номер) символу
# з початку файлу, де зараз знаходиться курсор.
#


fh = open('test.txt', 'w+')
fh.write('hello!')

position = fh.tell()
print(position) # 6

fh.seek(1)
position = fh.tell()
print(position) # 1

fh.read(2)
position = fh.tell()
print(position) # 3

fh.close()