# Дуже часто люди у своїх повідомленнях не ставлять великі літери, особливо це стало масовим явищем в еру мобільних.
# пристроїв. Розробіть функцію capital_text, яка прийматиме на вхід рядок з текстом і повертатиме рядок з відновленими
# великими літерами.
#
# Функція повинна:
#
# зробити великою першу літеру в рядку, попри прогалини
# зробити великою першу літеру після точки, попри прогалини
# зробити великою першу літеру після знака оклику, попри прогалини
# зробити великою першу літеру після знака питання, попри прогалини

def capital_text(s):
    result = ''
    capitalize_next = True

    for char in s:
        if capitalize_next and char.isalpha():
            result += char.upper()
            capitalize_next = False
        else:
            result += char.lower()

        if char in ('!', '.', '?'):
            capitalize_next = True

    return result


print(capital_text('alert. boss! oh'))







