# Кортежі
#
# Кортежі в Python — це важлива структура даних, подібна до списків, але з ключовою відмінністю: вони незмінні.
# Це означає, що після створення кортежу, не можна змінити його елементи, не можна додавати/видаляти/переставляти
# елементи. При спробі змінити кортеж, ви отримаєте повідомлення про помилку.
# Розглянемо основні аспекти кортежів. Щоб створити порожній кортеж, існують два способи, хоча й не зовсім зрозуміло,
# навіщо потрібний порожній кортеж 😄:
my_tuple = tuple() # або
my_tuple = ()

# cтворення ж непорожніх кортежів відбувається наступним чином:
my_tuple = (1, 2, 3)

# Якщо ви хочете створити кортеж з одним елементом, не забудьте поставити кому. Це важливо, запам'ятай це! Інакше ви
# отримаєте змінну, яка просто зберігає елемент кортежу.
my_tuple = (1,)

# Річ у тому, що Python використовує круглі дужки як математичні символи. Якщо написати вираз на кшталт my_tuple = (1),
# виникає невизначеність.
# Інтерпретатор розуміє такий вираз як суто математичний і просто прибирає зайві дужки, присвоюючи my_tuple значення 1.
# Щоб вказати, що це не математична операція, а саме кортеж, потрібно додати кому після значення.
# Тоді інтерпретатор однозначно зрозуміє, що ви хочете створити кортеж з одним елементом:
# Кортеж, як і список, може містити різні типи даних:
my_tuple = (1, "Hello", 3,14)

# Кортеж можна створити без дужок, ця операція називається упакування кортежу:
my_tuple = 1, "Hello", 3.14

# Із операції з кортежами ми маємо фактично тільки доступ до елементів. Ми можемо отримати доступ до елементів кортежу
# за допомогою індексації.
first_item = my_tuple[0]  # Отримати перший елемент

# Оскільки кортежі є незмінними, неможна додавати, видаляти або змінювати їх елементи після створення. Це робить їх
# ідеальними для використання в ситуаціях, де потрібно гарантувати, що дані залишаться без змін.

# Кортежі використовуються в багатьох сценаріях, наприклад, для зберігання набору констант або коли функція повертає
# кілька значень. Також вони корисні в якості ключів словників, оскільки ключі повинні бути незмінними.

# Незмінність кортежів обмежує їх застосування, в порівнянні зі списками, але дає можливість використати кортежі як
# ключі для словника або елементи множини.

# Наприклад, розглянемо набір точок на площині (кортежі). Їх можна використовувати як ключі у словнику:

points = {(0, 0): "O", (1, 1): "A", (2, 2): "B"}

# У словнику points використовуються кортежі з координатами точок як ключі, а значення — це імена (назва) точок.
#
# 💡 Головна різниця між кортежами та списками полягає в їхній незмінності. Кортежі — це чудовий вибір, коли тобі
# потрібна впорядкована колекція, яка не повинна змінюватися. Списки ж ідеально підходять для випадків, коли тобі
# потрібна подібна до кортежу структура, але з можливістю модифікації.