# Вступ
# Привіт!
# У цьому модулі ми дослідимо ключові аспекти роботи з файлами та модулями в мові програмування Python.
#
# Поговоримо про такі аспекти:
# - що таке файлові дескриптори в Python
# - текстові файли та використання методів для читання, запису та навігації по файлам.
# - робота з контекстними менеджерами
# - кодування та декодування рядків за допомогою ASCII, UTF-8 та CP1251
# - робота з файлами в бінарному режимі, запис текстових та бінарних файлів
# - створення та розпаковка архівів
# - створення власних пакетів
# - призначення файлу init.py
# - використання імпорту модулів в середовищі Python
# - використання пакетного менеджера pip
# - створення віртуального оточення
# - передача та обробка параметрів при виклику
#
# Оволодівши цими вміннями, ви зможете управляти роботою з файлами та модулями у Python. Це буде надзвичайно корисним у
# процесі розробки програм та проєктів.
#
# 💡 Також нагадуємо про важливість практикуватися. У конспекті, як завжди, ви знайдете значок ✂ та текст "Цей код можна
# виконати!", але ми переконані, що ви вже будете активно запускати код і практикуватися без додаткових нагадувань 😊
#
# Давайте розпочнемо! 😊