# Створіть програму на Python, яка ініціалізує порожній список і заповнює його певними значеннями за вказаними індексами.
#
# Задачі:
#
# Створіть порожній список my_list.
# Додайте до списку my_list наступні елементи, використовуючи індекси для їх розміщення:
# На позицію з індексом 0 помістіть ціле число 2024.
# На позицію з індексом 1 помістіть рядок 'Python'.
# На позицію з індексом 2 помістіть дійсне число 3.12.
# Очікуваний результат:
#
# Після виконання програми, список my_list повинен містити три елементи у зазначеному порядку: ціле число, рядок, та
# дійсне число.
#
# Підказки:
#
# Можете використовувати метод insert() для додавання елементів у список на відповідні позиції.
# Переконайтеся, що елементи додані у правильному порядку за заданими індексами.

my_list = []
my_list.insert(0, 2024)
my_list.insert(1, 'Python')
my_list.insert(2, 3.12)

