# Створіть програму на Python, яка ініціалізує порожній словник і заповнює його певними ключами та відповідними значеннями.
#
# Задачі:
#
# Створіть порожній словник data.
# Додайте до словника data наступні пари ключ-значення:
# Ключ year зі значенням цілого числа 2024.
# Ключ lang зі значенням рядка 'Python'.
# Ключ version зі значенням дійсного числа 3.12.
# Очікуваний результат:
#
# Після виконання програми, словник data повинен містити три пари ключ-значення, як вказано вище.

data = {}
data["year"] = 2024
data["lang"] = "Python"
data["version"] = 3.12
print(data)