# Використовуючи раніше створені змінні first_name та last_name, здійсніть конкатенацію цих змінних для формування
# повного імені.
#
# Задачі:
# Використовуючи змінні first_name та last_name, створіть нову змінну full_name.
# Змінна full_name повинна бути результатом конкатенації (об'єднання) first_name, пробілу (" ") та last_name.
# Використовуйте оператор + для конкатенації рядків.
# Очікуваний результат:
# Програма повинна створити та вивести змінну full_name, яка містить повне ім'я, складене з імені та прізвища,
# розділених пробілом.
#
# Підказки:
# Переконайтеся, що між ім'ям та прізвищем є пробіл.
# Пам'ятайте, що для об'єднання рядків використовують оператор +.
first_name = "Joe"
last_name = "Doe"
full_name = first_name + " " + last_name