# Булевий тип часто використовують, щоб позначити стан об'єкта. Наприклад, змінна is_active може вказувати, чи активний
# обліковий запис користувача, чи ні. Також акаунти користувачів часто не видаляють із бази даних, а просто встановлюють
# їм властивість is_delete – це називають soft delete (м'яке видалення). Використовуючи булевий тип даних у Python,
# встановити стан облікових записів користувачів за допомогою змінних is_active та is_delete.
#
# Задачі:
#
# Встановіть змінній is_active значення True, щоб вказати, що обліковий запис користувача активний.
# Встановіть змінній is_delete значення False, щоб вказати, що обліковий запис користувача не видалено.
# Очікуваний результат: Після виконання програми, ви повинні мати дві булеві змінні: is_active з істинним значенням та
# is_delete з хибним значенням.
is_active = True
is_delete = False