# Створіть чотири змінні різних типів даних у Python із відповідними значеннями.
#
# Задачі:
#
# Оголосіть змінну name, як рядок і присвойте їй текстове значення.
# Оголосіть числову змінну age і присвойте їй ціле числове значення.
# Оголосіть булеву змінну is_active і присвойте їй одне з булевих значень True або False.
# Оголосіть змінну subscription і встановіть її значення як None, щоб вказати на відсутність значення.
# Очікуваний результат:
#
# Після виконання програми, ви повинні мати чотири змінні name, age, is_active, subscription, кожна з яких представляє
# різний тип даних.
name = "Joy"
age = 42
is_active = True
subscription = None