# Кортежі
#
# Кортежі в Python — це важлива структура даних, подібна до списків, але з ключовою відмінністю: вони незмінні.
# Це означає, що після створення кортежу, не можна змінити його елементи, не можна додавати/видаляти/переставляти
# елементи. При спробі змінити кортеж, ви отримаєте повідомлення про помилку.
# Розглянемо основні аспекти кортежів. Щоб створити порожній кортеж, існують два способи, хоча й не зовсім зрозуміло,
# навіщо потрібний порожній кортеж 😄:
my_tuple = tuple() # або
my_tuple = ()

# cтворення ж непорожніх кортежів відбувається наступним чином:
my_tuple = (1, 2, 3)

# Якщо ви хочете створити кортеж з одним елементом, не забудьте поставити кому. Це важливо, запам'ятай це! Інакше ви
# отримаєте змінну, яка просто зберігає елемент кортежу.
my_tuple = (1,)

# Річ у тому, що Python використовує круглі дужки як математичні символи. Якщо написати вираз на кшталт my_tuple = (1), виникає невизначеність.
# Інтерпретатор розуміє такий вираз як суто математичний і просто прибирає зайві дужки, присвоюючи my_tuple значення 1. Щоб вказати, що це не математична операція, а саме кортеж, потрібно додати кому після значення.
# Тоді інтерпретатор однозначно зрозуміє, що ви хочете створити кортеж з одним елементом:
# Кортеж, як і список, може містити різні типи даних:
my_tuple = (1, "Hello", 3,14)
